In [38]:
import pandas as pd 

df = pd.read_csv("csv/salaries.csv")
df

       company                  job     degree  salary_more_then_100k
0       google      sales executive  bachelors                      0
1       google      sales executive    masters                      0
2       google     business manager  bachelors                      1
3       google     business manager    masters                      1
4       google  computer programmer  bachelors                      0
5       google  computer programmer    masters                      1
6   abc pharma      sales executive    masters                      0
7   abc pharma  computer programmer  bachelors                      0
8   abc pharma     business manager  bachelors                      0
9   abc pharma     business manager    masters                      1
10    facebook      sales executive  bachelors                      1
11    facebook      sales executive    masters                      1
12    facebook     business manager  bachelors                      1
13    facebook     business manager    masters                      1
14    facebook  computer programmer  bachelors                      1
15    facebook  computer programmer    masters                      1

In [39]:
inputs = df.drop('salary_more_then_100k', axis='columns')
target = df.salary_more_then_100k

In [40]:
from sklearn.preprocessing import LabelEncoder

le_company = LabelEncoder()
le_job = LabelEncoder()
le_degree = LabelEncoder()

In [41]:
inputs['company_n'] = le_company.fit_transform(inputs['company'])
inputs['job_n'] = le_job.fit_transform(inputs['job'])
inputs['degree_n'] = le_degree.fit_transform(inputs['degree'])

In [43]:
inputs.drop(['company','job','degree'], axis='columns', inplace=True)
inputs

    company_n  job_n  degree_n
0           2      2         0
1           2      2         1
2           2      0         0
3           2      0         1
4           2      1         0
5           2      1         1
6           0      2         1
7           0      1         0
8           0      0         0
9           0      0         1
10          1      2         0
11          1      2         1
12          1      0         0
13          1      0         1
14          1      1         0
15          1      1         1

In [46]:
inputs

    company_n  job_n  degree_n
0           2      2         0
1           2      2         1
2           2      0         0
3           2      0         1
4           2      1         0
5           2      1         1
6           0      2         1
7           0      1         0
8           0      0         0
9           0      0         1
10          1      2         0
11          1      2         1
12          1      0         0
13          1      0         1
14          1      1         0
15          1      1         1

In [54]:
from sklearn import tree

model = tree.DecisionTreeClassifier()
model.fit(inputs,target)
model.predict([[1,0,0]])

/Users/boyko/opt/anaconda3/lib/python3.8/site-packages/sklearn/base.py:445: UserWarning: X does not have valid feature names, but DecisionTreeClassifier was fitted with feature names
  warnings.warn(

array([1])

In [41]:
# HOMEWORK
import pandas as pd
df = pd.read_csv("csv/titanic.csv")

df[(df.Pclass == 1) & (df.Age >= 50) & (df.Age <= 60) & (df.Survived == 1)]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S
195,196,1,1,"Lurette, Miss. Elise",female,58.0,0,0,PC 17569,146.5208,B80,C
268,269,1,1,"Graham, Mrs. William Thompson (Edith Junkins)",female,58.0,0,1,PC 17582,153.4625,C125,S
299,300,1,1,"Baxter, Mrs. James (Helene DeLaudeniere Chaput)",female,50.0,0,1,PC 17558,247.5208,B58 B60,C
366,367,1,1,"Warren, Mrs. Frank Manley (Anna Sophia Atkinson)",female,60.0,1,0,110813,75.2500,D37,C
449,450,1,1,"Peuchen, Major. Arthur Godfrey",male,52.0,0,0,113786,30.5000,C104,S
496,497,1,1,"Eustis, Miss. Elizabeth Mussey",female,54.0,1,0,36947,78.2667,D20,C
513,514,1,1,"Rothschild, Mrs. Martin (Elizabeth L. Barrett)",female,54.0,1,0,PC 17603,59.4000,NaN,C
571,572,1,1,"Appleton, Mrs. Edward Dale (Charlotte Lamson)",female,53.0,2,0,11769,51.4792,C101,S
587,588,1,1,"Frolicher-Stehli, Mr. Maxmillian",male,60.0,1,1,13567,79.2000,B41,C
591,592,1,1,"Stephenson, Mrs. Walter Bertram (Martha Eustis)",female,52.0,1,0,36947,78.2667,D20,C
647,648,1,1,"Simonius-Blumer, Col. Oberst Alfons",male,56.0,0,0,13213,35.5000,A26,C
660,661,1,1,"Frauenthal, Dr. Henry William",male,50.0,2,0,PC 17611,133.6500,NaN,S
765,766,1,1,"Hogeboom, Mrs. John C (Anna Andrews)",female,51.0,1,0,13502,77.9583,D11,S
820,821,1,1,"Hays, Mrs. Charles Melville (Clara Jennings Gr...",female,52.0,1,1,12749,93.5000,B69,S
857,858,1,1,"Daly, Mr. Peter Denis",male,51.0,0,0,113055,26.5500,E17,S
879,880,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,0,1,11767,83.1583,C50,C

In [4]:
df.drop(['Name','Ticket', 'PassengerId','Cabin','Embarked','SibSp'],axis='columns',inplace=True)

In [5]:
df.isnull().sum()

Survived      0
Pclass        0
Sex           0
Age         177
Parch         0
Fare          0
dtype: int64

In [6]:
df.dropna(subset = ['Age'],inplace=True)

In [12]:
from sklearn.preprocessing import LabelEncoder
le_sex = LabelEncoder()
df['Sex_l'] = le_sex.fit_transform(df["Sex"])
df.drop('Sex',axis='columns',inplace=True)

In [13]:
df

     Survived  Pclass   Age  Parch     Fare  Sex_l
0           0       3  22.0      0   7.2500      1
1           1       1  38.0      0  71.2833      0
2           1       3  26.0      0   7.9250      0
3           1       1  35.0      0  53.1000      0
4           0       3  35.0      0   8.0500      1
..        ...     ...   ...    ...      ...    ...
885         0       3  39.0      5  29.1250      0
886         0       2  27.0      0  13.0000      1
887         1       1  19.0      0  30.0000      0
889         1       1  26.0      0  30.0000      1
890         0       3  32.0      0   7.7500      1

[714 rows x 6 columns]

In [18]:
target = df.Survived
input_n = df.drop('Survived',axis='columns')

In [19]:
from sklearn import tree

model = tree.DecisionTreeClassifier()
model.fit(input_n,target)

DecisionTreeClassifier()

In [20]:
model.score(input_n,target)

0.9845938375350141

In [ ]:
import seaborn as sn 
plt.figure(figsize = (10,7))
sn.heatmap(cm, annot=True)
plt.xlabel('Predicted')
plt.ylabel('Truth')

In [24]:
input_n.head()

   Pclass   Age  Parch     Fare  Sex_l
0       3  22.0      0   7.2500      1
1       1  38.0      0  71.2833      0
2       3  26.0      0   7.9250      0
3       1  35.0      0  53.1000      0
4       3  35.0      0   8.0500      1

In [31]:
model.predict([[3,20,0,10,0]])

/Users/boyko/opt/anaconda3/lib/python3.8/site-packages/sklearn/base.py:445: UserWarning: X does not have valid feature names, but DecisionTreeClassifier was fitted with feature names
  warnings.warn(

array([0])